{"id":"P326","slug":"using-the-projects-dashboard","content":"# Using the Projects Dashboard\n\n### Overview\n\nTwo reports are linked to the project's module. The first is an item-level report that considers the specific project in which it is nested, reporting exclusively on that project. The second is a general projects report that offers insights across all projects within the organization.\n\n### How to access the Projects Dashboard\n\n1. Navigate to Projects &gt; Project Reporting  \n    [![image-1703720716996.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/9kkjy2JzCqqAJBdu-image-1703720716996.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/9kkjy2JzCqqAJBdu-image-1703720716996.png)\n\n### Using the Projects Dashboard\n\nThe Projects Dashboard is divided into four sections: slicers, charts, cards, and the projects table.\n\n#### Slicers\n\nSlicers provides the user with the ability to filter all of the visuals on the page by a specific attribute and can be found at the top of the page.\n\nThe Projects Dashboard can be “sliced” based on no attributes, one attribute, or multiple attributes. The attributes available to “slice” by are RAG Status, Client, and Project Status.\n\nThe RAG status in project management is a visual indicator used to communicate the overall health and progress of a project. The term \"RAG\" stands for Red, Amber (or Yellow), and Green, representing three colour codes that signify different levels of status:\n\nRed = Project is overdue\n\nAmber = Task within project is overdue\n\nGreen = Nothing is overdue\n\nFor example, you could use the slicers to filter down the visuals to Projects that are “Green” and associated with the client “Example Inc”.\n\n[![image-1703720803555.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/51yxPlT4rrWOCWLm-image-1703720803555.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/51yxPlT4rrWOCWLm-image-1703720803555.png)\n\n#### Cards\n\nThe Cards section within the Projects Dashboard offers concise reference statistics. The values of these cards will change based on the slicers or if selections are made on Tasks table or charts.\n\nThe provided cards are as follows:\n\n- Active – Indicates the number of active projects (Where the status is “Not Started” or “In Progress”.\n- Green – Displays the number of projects where the project is not overdue and none of the sub tasks are overdue\n- Amber – Displays the number of projects where the project is not overdue but at least one subtask is overdue\n- Red – Displays the number of projects where the project is overdue.\n\n[![image-1703720847041.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/ih01K2HTYJCq9AIJ-image-1703720847041.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/ih01K2HTYJCq9AIJ-image-1703720847041.png)\n\n#### Charts\n\n##### Estimated Time vs Actual Time\n\nThe Estimated Time vs Actual Time visual shows a clustered column group for each Project. One column represents the sum of estimated time from all of that projects sub tasks. The second represents the sum time log hours against that project.\n\nIt is an interactive visual, allowing users to click on any of the status bars to filter the rest of the report by that specific status.\n\n[![image-1703720885666.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/72UVayCwW0TBKDnI-image-1703720885666.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/72UVayCwW0TBKDnI-image-1703720885666.png)\n\n##### Estimated Budget vs Actual Budget\n\nThe Estimated Budget vs Actual Budget visual shows a clustered column group for each Project. One column represents the sum of estimated costs for all budgets against the project and second represents the sum of actual costs for all budgets against the project.\n\nIt is an interactive visual, allowing users to click on any of the status bars to filter the rest of the report by that specific status.\n\n[![image-1703720955435.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/XCsg1jek9EQ7nObW-image-1703720955435.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/XCsg1jek9EQ7nObW-image-1703720955435.png)\n\n#### Projects Table\n\nThe Projects Table displays the Project Name, Client, Start date, Due date, Est. Hours, Act. Hours, Status, Overdue status, and a link to the rapid item.\n\nIt is an interactive visual, allowing users to click any task line and the report visuals will highlight or filter based on the selected employee.\n\n[![image-1703720970994.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/scaled-1680-/gFiAAWjcttKRfTsC-image-1703720970994.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-12/gFiAAWjcttKRfTsC-image-1703720970994.png)","name":"Using the Projects Dashboard","created_at":"2023-12-27T23:43:31.000000Z","updated_at":"2023-12-27T23:49:35.000000Z","url":"https://docs.rapidplatform.com/books/project-management/page/using-the-projects-dashboard"}