{"id":"P61","slug":"changelog","content":"# Changelog\n\n###   \n\n\n> ### **1.33.0 - Rapid Platform**\n> \n> **<span style=\"color: #95a5a6;\">*30/11/2023*</span>**\n> \n> <span style=\"text-decoration: underline;\">**Feature**</span>\n> \n> <span style=\"text-decoration: underline;\">Token Injection and Process Interruption</span>\n> \n> ***A simple scenario***\n> \n> Imagine a sales lead nurturing process. The workflow will:  \n> • Send newsletters, product updates every week to the lead  \n> • Every time before sending, check the lead status  \n> • If lead status = subscribed; send the material  \n> • If lead status = unsubscribed; display a form to gather reason for unsubscribing and End process.\n> \n> Before this release, the above case (and all similar requirements) was achieved by a combination of a Timer Intermediate Catch Event and an Exclusive gateway.\n> \n> [![Img 1.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/FKaqsMDqjxk0aftx-img-1.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/FKaqsMDqjxk0aftx-img-1.png)\n> \n> ***The problem with above solution***\n> \n> The Timer Intermediate Catch Event can only be configured to:\n> \n> • A specific point in time   \n> • A duration of delay\n> \n> Imagine the user who received a newsletter on a Tuesday. Upon receipt the Unsubscribe button was pressed. But the workflow will only check for the status next week. Till then the process token remains active.\n> \n> ***Token injection and process interruption***\n> \n> This release introduces a new type of Intermediate event – <span style=\"text-decoration: underline;\">**The Signal Intermediate Catch Event**</span>.\n> \n> [![Img 2.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/bTqlILcWLCxOznaR-img-2.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/bTqlILcWLCxOznaR-img-2.png)\n> \n> There are three fields which will help to configure the nature of this event:  \n> 1\\. **Choose a table** – select the required table from the list. This a mandatory field.  \n> 2\\. **Conditional Expression** – to provide the condition to be checked on a column value of the selected table. This is an optional field.  \n> 3\\. **Interrupting signal** – YES / NO – When turned YES, and the nature of the event becomes interrupting, else it remains non-interrupting.\n> \n> As the name suggests, this event is capable of:  \n> • Injecting a new token in the workflow process  \n> • Interrupt the existing process (kill all existing tokens)\n> \n>   \n> ***What does it mean?***\n> \n> The Signal Intermediate Catch Event gets triggered when:  \n> 1\\. an item is updated on the selected table (Default case - if the Conditional Expression is left empty)\n> \n> OR\n> \n> 2\\. an item is updated on the selected table AND the defined condition on the relevant column value is met.\n> \n> Considering our previous scenario, as soon as the lead Status turns “Unsubscribed”, this event will be triggered (if configured properly). Triggering of the event will generate a new token and the workflow will proceed forward from the subject intermediate event. Hence, token injection at the point in workflow where intermediate event is present, when the defined condition is met.\n> \n> Further, if the “Interrupting Signal” field is set to YES, it means that as soon as the subject intermediate event is triggered, all the existing active tokens will be terminated. The only active token in the process will be the one injected by the intermediate event.\n> \n> [![Img 3.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/uDYy7UHaJMZgkuoV-img-3.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/uDYy7UHaJMZgkuoV-img-3.png)\n> \n> When the intermediate event *interrupts* the existing process, the symbol (where the token was present at the time of interruption) will turn grey as seen above.\n> \n> When the intermediate event is triggered but *does not interrupt* the existing process, then all the tokens – i.e. the ones prior to triggering of intermediate event AND the one created by intermediate event trigger remain active in the process.\n> \n> [![Img 4.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/QRhkZIMCKCGYP1ix-img-4.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/QRhkZIMCKCGYP1ix-img-4.png)\n> \n> ***Another scenario***\n> \n> Imagine a company has a five-stage procurement process:\n> \n> - Stage 1 - identifying the need for a product or service\n> - Stage 2 - conducting research and gathering information about potential vendors\n> - Stage 3 - submitting requests for proposals or quotes\n> - Stage 4 - evaluating proposals and selecting a vendor\n> - Stage 5 - finalising and executing a contract\n> \n> The process is sequential in nature. However, in certain situations, it may be necessary to bypass a stage in order to expedite the procurement process.\n> \n> For example, if the company has a pre-existing relationship with a vendor and has already conducted extensive research on their products or services, they may choose to bypass Stage 2 and go directly to Stage 3 to request a quote or proposal.\n> \n> Alternatively, if the procurement process is taking longer than expected and the need for the product or service is urgent, the company may choose to bypass Stage 3 and go directly to Stage 4 to select a vendor and negotiate a contract.\n> \n> With the introduction of new <span style=\"text-decoration: underline;\">**Signal Intermediate Catch Event**</span>, the workflow diagram may appear as shown below:\n> \n> [![photo_2023-11-29 12.18.49.jpeg](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/PcW9CAMoU31on1Jp-photo-2023-11-29-12-18-49.jpeg)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/PcW9CAMoU31on1Jp-photo-2023-11-29-12-18-49.jpeg)\n> \n> If the intermediate event(s) are set as interrupting, then in the episode of a stage bypass, the existing token would be killed and the process will advance from the next relevant stage.\n> \n> <span style=\"text-decoration: underline;\">**Bug Fixes**</span>\n> \n> - Fixed feature level permissions getting confused between being on or off\n> - Ensured restarting a process with an errored data association no longer fails to restart\n> - User fields in Explorer will no longer mark the go-to user button as disabled\n> - Fixed choice field flyouts being random sizes depending on configuration\n> - Exit intent no longer tries to fire when deleting an item\n> - Configuring email communication activities in Workflow will no longer fail if the Principals view is missing columns\n> - Rolling back to the start of a process run will no longer drop input or signal context\n> \n> <span style=\"text-decoration: underline;\">**Improvements**</span>\n> \n> - Added v3 Adaptive document routing to Public Forms in preparation of release\n> - Prevented unconfigured data cans from being flagged as errored\n> - Process runs are now marked as completed when they have no active tokens\n> - Added copy behaviour to ledger content in Explorer\n> - Ensured the Delete Entity button doesn't randomly disappear\n\n> ### **1.32.0 - Rapid Platform**\n> \n> **<span style=\"color: #95a5a6;\">*27/11/2023*</span>**\n> \n> <span style=\"text-decoration: underline;\">**Features**</span>\n> \n> **Five new features get released in this edition.**\n> \n> **<span style=\"text-decoration: underline;\">1. Search field for Boards component</span>**\n> \n> A search box is added to the KanBan Boards component. This can be used to search items on the Board based on provided keyword(s). The behaviour is identical to the *Search items* field already present in Data Table List.\n> \n> **Benefit:** This feature is useful in filtering and finding items easily on the Board.\n> \n> Please refer to the video below for illustration on how this new field can be used to search Tasks on a Board:  \n>   \n> <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"420\" src=\"https://www.youtube.com/embed/Rxly3fTtIhg?si=kz0_HKky1gEnrznR\" title=\"YouTube video player\" width=\"750\"></iframe>\n> \n> **<span style=\"text-decoration: underline;\">2. Set default value of User Type field to current user</span>**\n> \n> If in a Data Table, you have a User Type column, you can now set its **Default Value to the current user**. Therefore, if User 1 is creating an Item, then the default value of the User column will be User 1; if User 2 is creating an Item, then the default value will appear as User 2.\n> \n> **Benefit:** This feature is particularly useful in reducing effort where the current user had to repeatedly select oneself while creating items.\n> \n> The default value can be set using the following steps:\n> \n> - - Navigate to Designer-&gt;Desired Table-&gt;Columns Tab-&gt;Desired User column.\n>     - Goto Default Value field.\n>     - Click \"Assign to Me\"\n>     - The Value \"@me\" appears in the field indicating it is set to current user as default.\n> \n> Please refer to the below video for illustration:  \n>   \n> <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"420\" src=\"https://www.youtube.com/embed/tqebQygjw3Q?si=P_zxya2D6pu5tXhl\" title=\"YouTube video player\" width=\"750\"></iframe>\n> \n> **<span style=\"text-decoration: underline;\">3. Create Item Service Task</span>**\n> \n> You can now generate items for an entity from within the Workflow. This means (for example) when this service task gets executed, it will add an item with defined field values to the Data Table.\n> \n> **Benefit:** This is particularly useful in reducing effort spent on creating items by configuring User Tasks, Flows etc. The values of the field can be controlled from within the workflow.\n> \n> You can pass both static values, as well as, Lodash expressions to the field.\n> \n> [![image-1699511973958.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/u6s7jVNX91qSlmUI-image-1699511973958.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/u6s7jVNX91qSlmUI-image-1699511973958.png)\n> \n> The UI is consistent with Data Association.\n> \n> To configure Create Item Service Task:\n> \n> 1. Select Create Item in Service Task\n> 2. Select entity\n> 3. Click +Add Field\n> 4. Select desired field - the system will display all the fields from the selected entity.\n> 5. Provide Value to the selected field.\n> \n> Please refer to the below video for illustration:  \n>   \n> <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"420\" src=\"https://www.youtube.com/embed/5lCFqC4kfIs?si=_HS0rS-emRvUoVHz\" title=\"YouTube video player\" width=\"750\"></iframe>\n> \n> **<span style=\"text-decoration: underline;\">4. Timer Start Events</span>**\n> \n> A new type is unlocked for Start Events - the Timer Start Event. You can now configure Timer Start Events in Workflow to have your processes start on a regular cadence.\n> \n> [![image-1699511775166.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/rHDMgbwqtFDOyL9g-image-1699511775166.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/rHDMgbwqtFDOyL9g-image-1699511775166.png)\n> \n>   \n> **Benefit:** This is particularly useful when you need a workflow to trigger at a specific time period. For example - an HR manager may want the appraisal cycle to trigger on 1st of March every year.\n> \n> Timers are configured using the frequency picker but can also be configured with regular [cron expressions](https://crontab.cronhub.io/).\n> \n> [![image-1699511805127.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/YIyZ6PdIYxSzH6Ke-image-1699511805127.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/YIyZ6PdIYxSzH6Ke-image-1699511805127.png)\n> \n> **Fields for Time Start Event:** A time period can be viewed as a hierarchy of units\n> \n> - Year\n> - Month\n> - Week\n> - Day\n> - Hour\n> - Minute\n> \n> The first field (*Every*) is used to define the frequency and the remaining lower fields are used to defined the exact point(s) on time period when the workflow should be triggered.\n> \n> For example - Every Month - defines that the workflow will be triggered every month.\n> \n> The lower fields are used to define on which day of the month / week - e.g. 1st of every month and every Sunday of the month.\n> \n> Further going down the hierarchy of time units, you can define what time of the day - e.g. 9 :15 am\n> \n> Therefore you can define the exact frequency and time when the workflow will be triggered.\n> \n> Based on the value selected for the first field (*Every*) the lower fields are displayed for definition.\n> \n> **Please note, if a field is not manually set, its default value is set to single unit. For example: if you have left the minute field blank, the workflow will be triggered every one minute.**\n> \n> **Displaying defined information**\n> \n> Based on the definition of frequency, the system will interpret and display the frequency as an English statement.\n> \n> [![image-1699970375350.29.29.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/L1lckztefFSRF4Ob-image-1699970375350-29-29.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/L1lckztefFSRF4Ob-image-1699970375350-29-29.png)\n> \n> Further, the system also displays a schedule for all the future runs of the workflow at the defined frequency (in batches of 5).\n> \n> [![Screenshot 2023-11-14 at 19.36.16.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/SbidcP2y7WVfHSxB-screenshot-2023-11-14-at-19-36-16.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/SbidcP2y7WVfHSxB-screenshot-2023-11-14-at-19-36-16.png)\n> \n> In case the set frequency is a non achievable case - For example - 31st February, then the schedule will display **N/A**.\n> \n> Please refer to the below video for illustration:  \n>   \n> <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"420\" src=\"https://www.youtube.com/embed/xEGekDGts0w?si=noOWB_nIrGaPD_m5\" title=\"YouTube video player\" width=\"750\"></iframe>\n> \n> <span style=\"text-decoration: underline;\">**5. Trigger a specific workflow from a Menu button**</span>\n> \n> You can now configure a Menu button to trigger a desired workflow from within Command Bar of the Explorer Item. There is a new option in the \"On-Click Action\" dropdown for Menu. It is titled - \"Workflow - Execute Process\".\n> \n> **Benefit** Prior to this feature, a Menu button could trigger a Workflow using the \"On-Click Action\" as \"Raise Workflow Created Signal\". A click on such a Menu button throws the Signal and **all the workflows** with relevant Trigger Start Events would get triggered with this.\n> \n> The subject feature is useful, when you do not want all the workflows to get triggered rather a very specific one.\n> \n> Therefore, this makes it very similar to manually pressing the \"Launch\" button from within the workflow, however, this time from within the Explorer.\n> \n> Further, you can also pass inputs from Explorer to the subject Workflow. (discussed later as Part II)\n> \n> To configure the menu button:\n> \n> 1. Navigate to / create the desired Menu in Designer\n> 2. Select On-Click Action as \"Workflow - Execute Process\"\n> 3. Enter the Process Diagram ID - The process diagram id is present on the url of the process diagram.   \n>       \n>     For example - https://test.rapidplatform.com/rapidplatform/projects/workflow/diagrams/**91**/edit  \n>       \n>     In the above URL - 91 is the Process ID.\n> \n> **Please note:** The workflow that you want to trigger from the Menu button triggers with any type of Start Event (normal / Signal / Timer). The Menu behaves like a manual Launch of the workflow process.\n> \n> Please refer to the below video for illustration:  \n>   \n> <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"420\" src=\"https://www.youtube.com/embed/oKvHHFbSqW4?si=rN5S7ryTx6DiwukV\" title=\"YouTube video player\" width=\"750\"></iframe>\n> \n> **PART II - This new feature also allows you to pass inputs to the Workflow from Explorer when the Menu button is clicked.**\n> \n> To achieve this you need to configure the Workflow's Process Input section. [![Screenshot 2023-11-15 at 2.23.59 PM.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/D8A5FQPa6DyeIdH0-screenshot-2023-11-15-at-2-23-59-pm.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/D8A5FQPa6DyeIdH0-screenshot-2023-11-15-at-2-23-59-pm.png)\n> \n> When you configure an Input field in the Process Inputs section, this enables you to provide a user input value at the time of manually triggering the Workflow from the Menu button.\n> \n> **A special case:** In case you have:\n> \n> - configured a Lookup type of Input field in the Process Input section, AND\n> - the Lookup is on the field of the same table where you have configured the menu button, AND\n> - the menu button is displayed on Item Level\n> \n> Then the system will pickup the Title field value from the subject Item and pre-fill the same in the Input field. This still remains editable, if you wish to manually change the value that gets passed to the Workflow.\n> \n> Please refer to the image below for illustration:\n> \n> [![Screenshot 2023-11-15 at 2.45.57 PM.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/scaled-1680-/ySuiajijRxL6tvWJ-screenshot-2023-11-15-at-2-45-57-pm.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-11/ySuiajijRxL6tvWJ-screenshot-2023-11-15-at-2-45-57-pm.png)\n> \n> **Bug Fixes**\n> \n> - Fixed popup not closing when clicking off a task entry in explorer with an embedded file selected\n> - Fixed multi-lookup and scoped-link fields failing to render correctly\n> - Repairing sites no longer overrides the primary group\n> - Fixed the titles not wrapping correctly when viewing the cards in the board component\n> - Fixed the logo header in the task experience to match branding guidelines\n> - Fixed email field not being greyed out when write permissions are turned off\n> - Fixed media queries incorrectly applying at the correct screen size\n> - Feature level permissions no longer apply when disabled\n> - UTF8 and UTF16 characters now render correctly in public forms\n> - Deleting a site no longer leaves the database intact\n> - Viewing an Adaptive Documents item in explorer no longer references a non existent column\n> - Loading spinner no longer aligned with the select all toggle when loading a data table\n> - Loading spinner no longer spins indefinitely when creating a new site\n> - Clicking on Workflow in the explorer menu no longer returns a 404 page not found error\n> - Fetching a sub-type of task that already had estimated\\_time value, no longer returned as an array\n> - Can create and update public forms with site and task id\n> - Manually triggering a process diagram with a signal start event now gives you full item results in the output\n> - Lookups on Workflow execution forms now fetch lookups\n> - Single embedded file component no longer adds a second file when another file is uploaded\n> - Set multiple item data cans to green completed when they fetch successfully\n> - Fixed the Board component not being able to fetch needed columns if the selected view was missing them\n> \n> **Improvements**\n> \n> - Added a confirmation modal in Workflow to prevent accidentally rolling back processes\n> - Embedded files preview panel updated to current design\n> - UI now maximizes the use of available screen space in page designer\n> - Removed illegal characters in DocX template names\n> - Adjusted the width of the Delete Entity pane\n> - Added buttons to toggle \"use created\" for the Drive and Folder ID's when configuring a new Embedded File\n> - Configuring page layouts are now displayed at a more appropriate size\n> - Adaptive Designer styling now matches the new branding\n> - Added search box to board component\n> - Added webhook trigger type to post webhook options\n> - File template configuration input fields now have added spacing\n> - Can now trigger a Workflow from a menu item\n> - Can now delete Embedded Files\n> - Added menus page in Designer and moved all list level menus out of the menu\n\n> ### **1.31.1 - Rapid Platform**\n> \n> **<span style=\"color: #95a5a6;\">*2/11/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Menu action templating</span>\n> \n> You can now use template strings in the open Hyperlink menu action, just like input field hyperlinks. We have also added three new parameters for templates to be aware of which server you are on.\n> \n> <table border=\"1\" style=\"border-collapse: collapse; width: 36.1478%;\"><tbody><tr><td style=\"width: 36.6795%;\">Parameter</td><td style=\"width: 63.6868%;\">Result</td></tr><tr><td style=\"width: 36.6795%;\">env</td><td style=\"width: 63.6868%;\">Either 'test' or 'prod'</td></tr><tr><td style=\"width: 36.6795%;\">tenant</td><td style=\"width: 63.6868%;\">The current tenant</td></tr><tr><td style=\"width: 36.6795%;\">site</td><td style=\"width: 63.6868%;\">The current site</td></tr></tbody></table>\n> \n> For example, you could create a link that goes to the correct tasks experience for the current site like so:\n> \n> \n> ```HTML\n> http://tasks.rapidplatform.<%= env!=\"prod\" ?\"com/_test\" : \"com/_prod\"%>/<%=tenant%>/<%=site%>\n> ```\n> \n> <span style=\"text-decoration: underline;\">HTML sanitise lodash function</span>\n> \n> When you have a textual input that contains HTML glyphs such as &lt;p&gt;&lt;/p&gt; or &lt;/br&gt; you can now invoke a built in lodash function to strip out these glyphs. For example, to remove the glyphs from a User Task description field would be like so:\n> \n> ```C#\n> <%=htmlToText(UserTask_0ak37ta.properties.description)%>\n> ```\n> \n> <span style=\"text-decoration: underline;\">Default Embedded Files</span>\n> \n> Continuing our learnings from template files, you can now configure at the table level a default embedded file definition. These default definitions can either point at the current item (and generate a folder as required) or a statically defined target folder in SharePoint. You can find the configuration in the newly reorganized Options tab when configuring a table.\n> \n> <span style=\"text-decoration: underline;\">Trigger on Change</span>\n> \n> You can configure Webhooks and Workflow Signal Events to conditionally trigger when one or more columns are updated. the changed() function now returns true or false if the indicated column is different from before it was updated.\n> \n> For example, you could configure a Signal Event to trigger when an Invoice is marked as Voided like so:\n> \n> [![image-1698121487818.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-10/scaled-1680-/lm3gmCSlwjowsjGg-image-1698121487818.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-10/lm3gmCSlwjowsjGg-image-1698121487818.png)\n> \n> Here the process will only trigger if both the status was changed, and if it was changed to 'VOIDED'.\n> \n> The syntax for changed is:\n> \n> ```C#\n> changed('column_name')\n> ```\n> \n> <span style=\"text-decoration: underline;\">Workflow Element Coalescing</span>\n> \n> For those of you working with multiple branching paths in Workflow that need to reference something that could have been created on one of them, you can now reference elements in lodash regardless if they have been executed.\n> \n> This is best demonstrated with an example, consider this process:\n> \n> [![image-1698286562357.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-10/scaled-1680-/ClXzMSDWnMqZNIf0-image-1698286562357.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-10/ClXzMSDWnMqZNIf0-image-1698286562357.png)\n> \n> This process could optionally start from three difference causes; either manually with an input, or triggered via a create or update signal. The AllField data can now references whatever the starting item is and collapses the trigger item into a single place to easily reference throughout the document. The syntax to configure this can is;\n> \n> ```Java\n> <%= inputs?.all_field?.id ?? StartEvent_1?.properties?.id ?? StartEvent_0wzx24k?.properties?.id %>\n> ```\n> \n> Previously trying to reference StartEvent\\_1 or StartEvent\\_0wzx24k would throw an error as only one existed. This has been resolved.\n> \n> Outside of starting situations, you can also collapse something created in a branching path for later referencing. Again a Data Can is used here but is not required. The Task can references the single letter task that was chosen (A, B or C) so that it can be reviewed in the Combine task. For completeness the syntax in the Task can is:\n> \n> ```Java\n> <%= inputs?.all_field?.id ?? StartEvent_1?.properties?.id ?? StartEvent_0wzx24k?.properties?.id %>\n> ```\n> \n> **Bug Fixes**\n> \n> - Prevented tab freeze when configuring pages in Designer under certain conditions\n> - Stopped Table search being case sensitive\n> - Disabled and removed public forms where the task has been completed in all cases\n> - Fixed UI failing to react when clearing / updating template folder configuration\n> - Enabled attachments to be added via drag-n-drop regardless of file type\n> - Fixed daylight savings time being regarded for Public Form submission timeout\n> - Prevented page crash when closing the 'Add to form' panel in Designer on a table with &gt;30 columns\n> \n> **Improvements**\n> \n> - Upgraded styling on required fields in Explorer for readability\n> - Improved Rich Text area styles when disabled to display as rich text instead of HTML\n> - Added time to notes in the Activity feed\n> - Added 401 page when navigating to experiences where the user is not allowed\n> - Added collapse mode to workflow configuration panel (and stopped it popping out on click!)\n> - Put back the Users' displayed email in User fields\n> - Added Estimated time and On Hold status to Tasks, removed Failed status\n> - Added support for principal unique ID in workflow user task configuration\n> - Added default pages for Workflow Folders system list\n> - Added feedback when uploading a process diagram using the new creation panel\n> - Added Excel Date column when exporting data for better date consistency between locales\n> - Added Multi-Lookup update/replacement support into Public Forms and API requests\n> - Upgraded Tasks, Designer and the Login screens to match the new branding\n\n> ### **1.31.0 - Rapid Platform**\n> \n> **<span style=\"color: #95a5a6;\">*12/10/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">UI Styling Upgrade</span>\n> \n> [Rapid Platform System Upgrades](https://docs.rapidplatform.com/attachments/2)\n> \n> Following the Rapid Platform branding upgrade, Explorer, Designer and Workflow have gotten a facelift. This includes a change to routes for Designer and Workflow\n> \n> <table border=\"1\" style=\"border-collapse: collapse; width: 49.7361%; height: 106px;\"><tbody><tr><td style=\"width: 50.0661%;\">**Previously**</td><td style=\"width: 50.0661%;\">**Now**</td></tr><tr><td style=\"width: 50.0661%;\">/{tenant}/{site}/Dezigna</td><td style=\"width: 50.0661%;\">/{tenant}/{site}/Designer</td></tr><tr><td style=\"width: 50.0661%;\">/{tenant}/{site}/Compoza</td><td style=\"width: 50.0661%;\">/{tenant}/{site}/Workflow</td></tr></tbody></table>\n> \n> <span style=\"text-decoration: underline;\">Authed Forms</span>\n> \n> It is now possible to configure an authenticated public form. Configuring a form to be authed will require the user to put in a predetermined, generated password before proceeding to the form. It is possible to set auth from workflow and have a password be generated or manually. 2 new columns were added to the tasks table to allow for this.\n> \n> <span style=\"text-decoration: underline;\">Custom Users and Minimal Install</span>\n> \n> Principals can now be created manually.\n> \n> In our continued quest to make Rapid as flexible as possible you can now install a limited version without requiring application consent. This change alters the install mechanism to not require SharePoint or Groups access. This will install a site with the creating user only. In order to enable inviting users you can now create principal records to manually create both users and groups.\n> \n> When adding a new User the only required information is an email address. This will try to match the User on your active directory (if access is granted) and backfill details when available. Any user that can authenticate to your tenant that have a matching email address to a User in the site will now be able to login.\n> \n> To help manage membership in cases when groups are not accessible, you can now manually add &amp; remove principals to groups using the command bar. You can view the membership using the Principals tab on a group, with a plan to build a custom membership control at a later stage.\n> \n> Sites created with no application permissions will have reduced functionality, notably around files and emails.\n> \n> <u>Added pipeline page control  \n>   \n> </u>It is now possible to add the pipeline control to a page layout in legacy designer, this will allow the connection to a choice field and will display that choice field in a tasteful way as a method of describing progress.\n> \n> <span style=\"text-decoration: underline;\">New fetching query parameters</span>\n> \n> With the development of Adaptive v3, additional query parameters have been added to fetch lists of items based around their link relationships. Check the [API Concepts](https://docs.rapidplatform.com/link/20#bkmrk-odata-function-refer) page for further details.\n> \n> **Bug Fixes**\n> \n> - Prevented page crash when configuring a Trigger a Webhook service task\n> - Fixed 'Failed to Load' race condition on Explorer components when refreshing a page\n> - Squashed Resize Observer error in console\n> - Prevented erroneous error being reported when timers return to a deleted process run or diagram\n> - Fixed conditions failing to fire in Adaptive Designer when configuring connections\n> - Stopped menu actions with a form from sending the request on blur or when cancelled\n> - Fixed site repairs with more than 700 principals failing to complete\n> - Fixed selected items in multi-lookup fields failing to display as ticked\n> - Fixed quick search on data tables failing to react after opening an item on the list\n> - Saving in the Tasks experience without document storage set up no longer fails\n> - Prevented command bar action buttons from sending when pressing cancel\n> \n> **Improvements**\n> \n> - Ensured Preform Remote Action menu items always send\n> - Made the group picker optional when installing a site\n> - Removed extraneous padding on new lines in multi-line text fields\n> - Added route to fetch Principals based on their membership\n> - Wide sweeping CSS upgrades and library updates throughout UI-React\n> - Ensured page creation state is not re-rendered until after an item is fully created\n> - Improved table scoped command bar actions to respect all possible configurations\n> - Added Choice pipeline component\n> - Upgraded cascading lookup configuration in Designer to be able to regard full query logic\n> - Added Pages page in Designer to manage the pages on the site\n> - Added manual override control for Prefill data configuration in Workflow user tasks\n> - Styled 404 and 403 pages\n\n> ### **1.30.14 - Folder Templates**\n> \n> **<span style=\"color: #95a5a6;\">*31/08/2023*</span>**\n> \n> **Features**\n> \n> [<u>Folder Templates</u>](https://docs.rapidplatform.com/link/209#bkmrk-item-folder-template)\n> \n> Through Designer, it is possible to now configure a folder to use as a template for a particular list. If configured, when creating an item when the 'always create folder is enabled', the contents of the folder will be set on that item. For existing items, the folder will be cloned when creating a new folder for the item through the UI.\n> \n> [<u>URL Parameter for universallyLinkedTo</u>](https://docs.rapidplatform.com/link/20#bkmrk-how-to-get-a-bunch-o-1)\n> \n> Like the LinkedTo param, putting this in a get Items request from RAPID will return any items for the specified list that are universally link to the specified item, this will not return scoped universal links.\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where lists cannot be deleted due to since deleted lookup fields\n> - Prevented page crash on Workflow when viewing malformed sequence flows\n> - Fixed files component in Public Forms failing to upload a file when within a child connection\n> \n> **Improvements**\n> \n> - Added a suite of Workflow Integration tests\n> - Added the IN Odata query operator, using the following syntax IN(&lt;column name&gt;,&lt;value1&gt;,&lt;value2&gt;)\n> - Added toggle on Perform Remote Action menu items to send a batch request instead of individuals\n> - Added default filter to Adaptive Designer when selecting a document to not regard apps\n> - Hide the execute diagram button if a non-executable diagram is opened\n> - Improved UI for configuring cascading lookups\n> - Cascading lookups now use OData filters\n\n> ### **1.30.13 - Adaptive Bug Fixes**\n> \n> **<span style=\"color: #95a5a6;\">*187/08/2023*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where editing a prefilled multi line text field would sometimes clear\n> \n> **Improvements**\n> \n> - Added the ability to theme the login screen\n\n> ### **1.30.12 - Workflow Rollback**\n> \n> **<span style=\"color: #95a5a6;\">*20/07/2023*</span>**\n> \n> **Breaking Change - API user webhook control**\n> \n> A new query parameter has been added to POST/PUT requests called webhooks. When true requests will trigger webhook events to fire, when false it will prevent them. This new parameter is assumed to be true for normal requests, but is assumed to be false for Application User requests.\n> \n> All requests made by application users that require webhook events to fire will need to add <span style=\"text-decoration: underline;\">webhooks=true</span>\n> \n> **Features**\n> \n> <u>Rollback support in Workflow</u>\n> \n> While viewing a process run in Workflow you can now select a previously executed element and revert the run back in time to there. For example, selecting a User Task will roll back the process to just prior re-creating the task. Rolling back a process will abort existing tasks and timers to help clean up.\n> \n> **Bug Fixes**\n> \n> - Fixed resuming unconfigured data associations erroneously failing\n> - Fixed page crash when configuring some condition cases in Adaptive Designer\n> - Re-enabled success toast on items in Explorer\n> - Enabled the disable deletion configuration to persist through refresh\n> - Refreshed page set when navigating between different Tasks sites\n> - Fixed attachment records failing to refresh when navigating between different tasks in the Tasks experience\n> - Improved reactivity when uploading attachments in the Tasks experience\n> \n> **Improvements**\n> \n> - Ensured site details (environment, tenant, site) are on menu action requests\n> - Added concurrency support for resumes in workflow\n> - Added Embedded File column support in data tables for Explorer\n> - Improved performance on lists that contain multi-lookup fields\n> - Added error message reflection to UI when service tasks fail in Workflow\n> - Enforced currency formatting in data tables to be 2 decimal places\n\n> ### **1.30.11 - SendGrid support in User Tasks**\n> \n> **<span style=\"color: #95a5a6;\">*6/07/2023*</span>**\n> \n> **Features**\n> \n> <u>User Task Communication Support</u>\n> \n> You can now leverage the existing communication infrastructure in User Tasks when configuring your Workflows. This currently only supports SendGrid but will naturally extend to more communication channels as they become available.\n> \n> <u>Embedded File Control</u>\n> \n> Added the embedded file control to Adaptive. This allows custom pages to render an embedded file definition and allow file viewing and uploading.\n> \n> **Bug Fixes**\n> \n> - Fixed Adaptive Designer overview page failing to populate on refresh\n> - Added more robust error handling and reporting when Data Cans run into problems\n> - Fixed Embedded Files configuration being destroyed by update item menu actions\n> - Fixed dependant lookup construction failing when regarding filters on base tables for sub-types\n> - Updated the Due Date for tasks generated in a loop to regard now, rather than the start of the loop\n> \n> **Improvements**\n> \n> - Added exit intent configuration on all Explorer menu buttons\n> - Added Embedded Files control to Adaptive control library\n> - Added environment variables to webhooks and remote actions in Explorer\n\n> ### **1.30.10 - Control Deletion at List Level**\n> \n> **<span style=\"color: #95a5a6;\">*29/06/2023*</span>**\n> \n> **Features**\n> \n> <u>List Deletion Configuration</u>\n> \n> It is now possible to enable/disable delete buttons for a list and its items in Explorer using configuration in Designer. This feature helps prevent accidental deletions in linked contexts.\n> \n> **Bug Fixes**\n> \n> - Repeating sections no longer crash the page in certain prefill scenarios\n> - Aliased illegal characters in view names\n> - Enabled common names\n> - Webhooks and signal events now fire on workflow update data association\n> - Fixed cases where an entity cannot be deleted due to foreign key constraints\n> \n> **Improvements**\n> \n> - Added ability to copy json paths containing spaces and other characters in workflow\n> - Added validation for view names\n> - Command bar is now disabled when no document is selected\n> - Site creation timeout increased to 5 minutes\n\n> ### **1.30.9 - Form Submission Custom Pages**\n> \n> **<span style=\"color: #95a5a6;\">*15/06/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Successful Submission Form</span>\n> \n> It is now possible to configure a form or page to be shown in form service after the submission of a form. This is configured on a form level, where successful or errored submissions of the form can have a custom page shown rather than the default success/fail pages.\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where lists fail to delete due to foreign key constraints\n> - Fixed a page crash in forms service when a lookup is prefilled to null\n> - Fixed a crash when typing 2 characters at once in a multi line field with a default value set\n> - Fixed an issue where repeating sections will submit null when containing a default value\n> \n> **Improvements**\n> \n> - Priority and all other required fields will now be fetched for the tasks experience\n> - Resolved an issue where an erroneous error is thrown on creation of a folder\n> - It is now possible to compare 2 columns together in an OData Filter\n> - When creating or updating a view with an invalid request, no longer times out but returns error\n> - Inactive users will no longer attempt to have SharePoint permissions synced to\n\n> ### **1.30.8 - Workflow Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*01/06/2023*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where process runs fail to resume due to cans referencing a deleted item\n> - Fixed an issue where forms fail to submit in certain repeating section cases\n> \n> **Improvements**\n> \n> - Updated error responses for invalid ID being updated\n> - Timers resuming when it has already succeeded will no longer error\n\n> ### **1.30.7 - Authenticated Requests**\n> \n> **<span style=\"color: #95a5a6;\">*18/5/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">API Key Requests</span>\n> \n> With the positive feedback from last weeks Authenticated requests from Workflow Service Tasks, we have also added API key support. API Keys still are powered by RAPID Integrations on your site and can be configured in several ways depending on how your target API would prefer to receive its keys.\n> \n> #### Custom Header\n> \n> `CUSTOM_KEY = \"X-API-KEY\"`\n> \n> ```Nginx\n> GET / HTTP/1.1<br></br>Host: example.com<br></br>[CUSTOM_KEY]:  [Your Integration Key]\n> ```\n> \n> #### Basic Authentication\n> \n> ```Nginx\n> GET / HTTP/1.1<br></br>Host: example.com<br></br>Authorization:  Basic [Your Integration Key]\n> ```\n> \n> #### Query String\n> \n> `CUSTOM_KEY = \"apiKEY\"`\n> \n> ```Nginx\n> GET / HTTP/1.1<br></br>Host: example.com<br></br>Params:  {<br></br>  [CUSTOM_KEY]: [Your Integration Key]<br></br>}\n> ```\n> \n> #### Body Parameter\n> \n> `CUSTOM_KEY = \"API-KEY\"`\n> \n> ```Nginx\n> GET / HTTP/1.1<br></br>Host: example.com<br></br>Body:  {<br></br>  [CUSTOM_KEY]: [Your Integration Key]<br></br>} \n> ```\n> \n> <span style=\"text-decoration: underline;\">Adaptive Cascading Lookups</span>\n> \n> You can now configure cascading lookups in Adaptive documents. Cascading lookups regard another lookup on the document and once configured with a matching criteria will filter the items fetched by that criteria, just like in Explorer.\n> \n> This support should be live for both Tasks and Public form.\n> \n> **Bug Fixes**\n> \n> - Fixed creating RAPID Integrations with a Username failing to save on first create\n> \n> **Improvements**\n> \n> - User Tasks in Workflow will now return their entire item profile on creation, rather than just completion\n\n> ### **1.30.6 - Workflow Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*11/5/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Update Associations</span>\n> \n> With the advent of Cans you can now configure the Data Association (dotted arrow) from an Activity towards a Can to set values of the associated item. This update is performed after the action is completed, so that you can capture data collected during the activity itself.\n> \n> [![image-1683777706558.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-05/scaled-1680-/4wPJa9cG1uzvpQj2-image-1683777706558.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-05/4wPJa9cG1uzvpQj2-image-1683777706558.png)\n> \n> <span style=\"text-decoration: underline;\">Authenticated Service Tasks</span>\n> \n> Webhook service tasks can now use Basic authentication when interacting with remote APIs. This authentication is created and stored in a newly updated Rapid Integrations list. When creating a new integration the Username and Password are stored securely in Azure Key Vault and not on your site. As a consequence you will not be able to see stored passwords. Updating a Username or Password will overwrite the value in the Key Vault and thus be used by Workflow form then on.\n> \n> <span style=\"text-decoration: underline;\">Lookup View Whitelisting</span>\n> \n> When configuring a Lookup component in Adaptive Pages and Forms, you can now select a subset of views on the target table to present to the User. By default the All view will still be the first selected view.\n> \n> **Bug Fixes**\n> \n> - Fixed Default values for Choice fields in Adaptive Pages and Forms failing to load\n> - Fixed long placeholder and content values of Choice fields extending out the page\n> - Fixed deleted RAPID Sites persisting in cache storage\n> \n> **Improvements**\n> \n> - Disabled Save and Complete buttons on Tasks while saving/completing\n\n> ### **1.30.5 - Workflow Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*27/4/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">DocX Image Support</span>\n> \n> You can now use [Images](https://docxtemplater.com/modules/image/) in the DocX Templater when filling in documents. With the {%ImageName} syntax you can insert new images, or replace existing images by setting their Alt text. Images replaced will respect the image size boundaries while also trying to respect the source image aspect ratio to prevent overflow in your documents. Small images will retain their size if they are smaller than the image they're replacing.\n> \n> Images can be sourced from SharePoint, as with all files in RAPID.\n> \n> <span style=\"text-decoration: underline;\">Adaptive Output Support</span>\n> \n> User Tasks in workflow with an attached adaptive forms now present the items created or updated in the ledger. These can be accessed to help identify what happened. Items affected are now available on a 'context' key after the task is completed.\n> \n> <span style=\"text-decoration: underline;\">Prefill Type Coercion</span>\n> \n> Prefill data now parses strings. For example numbers and Boolean values will be cast to their correct type. Booleans are case sensitive, as per these examples:\n> \n> - \"1\" &gt; 1\n> - \"0\" &gt; 0\n> - \"true\" &gt; true\n> - \"false\" &gt; false\n> - \"TrUe\" &gt; \"TrUe\"\n> - \"FaLSe\" &gt; \"FaLSe\"\n> \n> This system follows the standard [json.parse / json.stringify](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify \"Docs\") behaviour.\n> \n> **Bug Fixes**\n> \n> - Fixed duplicate universal links created from workflow\n> - Fixed negative numbers in number fields changing to positive\n> - Prevented page crash when list names start with numbers\n> - Fixed page snapping to top when expanding a lookup in a form\n> - Prevented 'Get items' service tasks without a view selected, from fetching raw items\n> \n> **Improvements**\n> \n> - Update styling on Delete intent modal\n> - Users can now remove default repeating sections\n> - Updated forms test url to point to new server\n\n> ### **1.30.4 - Document Theming**\n> \n> **<span style=\"color: #95a5a6;\">*21/4/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">DocX Theme Support</span>\n> \n> Word Documents support different Themes and the Fill Document service task (powered by DocX) now does as well. You can now configure custom theme colours which will be applied to the produced document. This sets the actual Word theme, so any content within can be styled. The theming interface mirrors the Theme configurator in Word itself to make it easy to map your custom themes across.\n> \n> One word of warning, Word Online has different behaviour around custom themes as compared to Word running locally. We have noticed the first two theme colours (Text Light 1 and Text Dark 1) are respected by Word Online but instead set to black and white locally.\n> \n> <span style=\"text-decoration: underline;\">Adaptive Required Field Support</span>\n> \n> Marking fields as required in Adaptive documents will now be respected by both Public Forms and the Task Experience. Public forms with empty required fields will prevent submission of the form. Tasks can be altered and saved so that they can be pushed out or slowly filled in over time, but trying to complete a task with missing required fields will now direct the user to fill them in.\n> \n> This update has no effect on Explorer.\n> \n> **Bug Fixes**\n> \n> - Fixed failure to save a task in the Task Experience if it did not have a document configured\n> - Fixed parallel gateway merges in loop scenarios failing to wait for all the tokens before completing\n> - Fixed inline refresh on the Tasks Experience failing to actually refresh with items\n> - Prevented repeating sections with 0 items creating a blank item on submission\n> \n> **Improvements**\n> \n> - Added confirmation modal to Adaptive Designer delete button\n> - Hidden universal links to notifications in Adaptive Tasks\n> - Enabled item creation blacklisting on Gantt and Board components in Explorer\n> - Cleaned up Tasks experience mobile style from feedback\n\n> ### **1.30.0 - Mobile Tasks**\n> \n> **<span style=\"color: #95a5a6;\">*13/4/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Mobile Tasks</span>\n> \n> The Tasks experience has been upgraded with a mobile friendly style sheet. This styling change comes with improvements for buttons including a disabled state on task side menus when they are empty. As always these improvements are powered by feedback, so hearing back about how if works on your device is highly appreciated.\n> \n> **Bug Fixes**\n> \n> - Nailed down (finally) the last cases where prefilled lookups fail to present their display field\n> - Prevented page crash when expanding the activity feed on some tasks in the Tasks experience\n> - Prevented page crash when adding components to a section in Adaptive Designer with a Process Diagram context\n> - Fixed workflow failing to link produced items in a process run to the triggering item on signal event processes\n> - Prevented Adaptive login screen forcing cursor to end of line in the tenant/site fields\n> \n> **Improvements**\n> \n> - Set Tasks experience side panels to disabled when they do not contain any content\n> - Enforced consistent author id when Workflow produces items\n> - Raised date picker modal above all elements when interacting with it\n> - Added automated repair mechanism for product owners to manage their customer sites\n\n> ### **1.29.4 - Bulk Support**\n> \n> **<span style=\"color: #95a5a6;\">*30/3/2023*</span>**\n> \n> **Improvements**\n> \n> - Added bulk selection to the Adaptive Designer component selector\n> - Added new query parameter on bulk creation to enable events to be fired\n> - Enabled events to be fired in Public Forms when creating items in a repeating section\n> - Moved site file caching external and enabled multiple Minilith pods\n> - Lookups in Public Forms now present a more obvious search bar and load 50 items rather than 10\n\n> ### **1.29.0 - Notification Support**\n> \n> **<span style=\"color: #95a5a6;\">*23/3/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Notification Lists</span>\n> \n> Notifications and Audiences have been upgraded from an internal table to full list support. This enables access to access and control of notifications via the API for the creation of 3rd party notification systems. See the Technical Documentation for requirements to produce and manage notifications.\n> \n> <span style=\"text-decoration: underline;\">Environment Headers</span>\n> \n> Webhooks and Service tasks sent from RAPID to external systems now will carry environment information in their headers. This allows for the creation of third party endpoints that can react differently if a request is received from Test or Production.\n> \n> **Bugfixs**\n> \n> - Fixed dates pulled from a Data Store using Lodash in Workflow v3 returning a JS date instead of an ISO date\n> - Fixed lookups prefilled with just an ID failing to fetch the display field in Tasks\n> - Enabled JSON fields on base tables to be returned on the All$ view, matching behaviour with sub tables\n> \n> **Improvements**\n> \n> - Enabled input limits on Adaptive Input components\n> - Added Adaptive File Component support when placed in the Tasks experience\n> - When searching for a component to add in the Adaptive Designer, the All view now can regard a list context\n> - Added multi-select to the component adding panel in Adaptive Designer\n> - Added improved error messaging when trying to submit a public form that had been removed from a local store\n\n> ### **1.28.4 - Data Cans**\n> \n> **<span style=\"color: #95a5a6;\">*16/3/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Data Cans</span>\n> \n> It is now possible to add data cans to workflow diagrams. These act as persistent get item or get items service task, where you can reference them and fetch the most upto date state of the item(s)\n> \n> <span style=\"text-decoration: underline;\">Error Boundary Event</span>\n> \n> There is now support for the error boundary event, if the attached activity gets into an errored state, the boundary path will be taken.\n> \n> **Bugfixs**\n> \n> - Fixed the Multi Line text control in tasks and anonymous forms\n> - Removing a condition no longer drops the whole array of conditions\n> - Fixed a page crash on editing form state in Designer\n> \n> **Improvements**\n> \n> - Added support for double clicking webhook service tasks opening the run information URL\n> - Theme.css file is now loaded into Designer\n\n> ### **1.28.2 - Adaptive Cleanup**\n> \n> **<span style=\"color: #95a5a6;\">*9/3/2023*</span>**\n> \n> **Bugfixs**\n> \n> - Fixed create pages configured in Tasks failing to render for sub-types of tasks\n> - Fixed the configuration panel in Adaptive Designer showing an empty configuration when opened\n> - Prevented a page crash when viewing embedded files in the Tasks experience\n\n> ### **1.28.1 - Styling and Cleanup**\n> \n> **<span style=\"color: #95a5a6;\">*2/3/2023*</span>**\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">DocX PDF Support</span>\n> \n> You can now generate a PDF from the DocX service task. When creating a PDF file the original word file will still be produced. When referencing the embedded files configuration of the DocX service task in Workflow with PDF selected, the PDF file will be returned instead.\n> \n> Additionally there is now a toggle to preserve the {moustache glyphs} within your documents when running the service task. By default these glyphs will now be replaced with a blank character.\n> \n> **Bugfixs**\n> \n> - Fixed a page crash when navigating between the login page and task list in the Tasks Experience\n> - Fixed conditions in repeating sections failing to evaluate\n> - Fixed subtypes of items linked via lookup failing to be fetched in linked scenarios\n> \n> **Improvements**\n> \n> - Repeating sections in Adaptive now fetch all fields contained within them, including multi-line text fields\n> - Added Theme.css file support to the Tasks experience\n> - Added search when using @mentions in the Activity Feed for sites with more than 250 users\n> - Added click-through support between Explorer and Workflow when opening process runs inside call activity scopes\n> - Added new custom rich text editor to Adapative, replacing the Multi-Line Text Control\n\n> ### **1.27.28 - Tasks &amp; Workflow v3**\n> \n> **<span style=\"color: #95a5a6;\">*27/02/2023*</span>**\n> \n> This release contains a one-two punch of the brand new Tasks experience as well as the shiny new Workflow v3 engine.\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Tasks Experience</span>\n> \n> Leveraging the Adaptive Documents design, the new [Tasks experience](https://tasks.rapidplatform.com/) brings the associated document front and centre.\n> \n> This also comes with a new connection type to configure your Adaptive Documents, the 'Expected Context' connection. Expected Contexts allow you to define which item type (or sub-type) you are expecting to be present when opening the task. With this you can define how items that are created and updated via an Adaptive document relate to the task, if at all!\n> \n> <span style=\"text-decoration: underline;\">Workflow v3</span>\n> \n> Workflows' engine has been replaced with a brand new version built from scratch. Faster, more powerful and much more extensible; Workflow 3 unlocks finally implementing more of the BPMN 2.0 specification. One of the most drastic changes comes in the form of Call Activities and their child process runs. To be more in accordance with the BPMN 2.0 specification, and to support future Data Cans and Documents, sub-processes are now incorporated in their parent ledger.\n> \n> While this engine upgrade is mostly future facing, it does come with some spicy new improvements right now\n> \n> <span style=\"text-decoration: underline;\">Custom Post Bodies</span>\n> \n> You can now configure custom post bodies in Webhook service tasks. Now you can simplify getting the data you want out of your process by using powerful Lodash expressions. Blank configurations will continue to post the entire ledger, so existing diagrams will not be affected.\n> \n> [![image-1675672801035.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-02/scaled-1680-/JpcR0qEnY88DLaqH-image-1675672801035.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-02/JpcR0qEnY88DLaqH-image-1675672801035.png)\n> \n> <span style=\"text-decoration: underline;\">Non-Interrupting Timers</span>\n> \n> Configuring a Timer to be non-interrupting allows the creation of follow-up and checking branches in your process, without disrupting mission critical tasks.\n> \n> [![image-1675673069610.png](https://docs.rapidplatform.com/uploads/images/gallery/2023-02/scaled-1680-/1ACSc8EfzJiyyXo6-image-1675673069610.png)](https://docs.rapidplatform.com/uploads/images/gallery/2023-02/1ACSc8EfzJiyyXo6-image-1675673069610.png)\n> \n> **Improvements**\n> \n> - Added spinner to RP Forms when loading the framework\n> - Added multi-lookup field support to Adaptive Documents\n> - Removed erroneous .toString when processing id values via the SDK\n> - Implemented sub-process navigation to Explorer and Workflow UI\n> \n> **Bug Fixes**\n> \n> - Fixed Context Missing error when trying to create columns called 'Title' on new tables\n> - Fixed missing clear value buttons on User and Date fields in Adaptive Documents\n> - Prevented root level crash when adding Time Picker component to a page\n> - Fixed custom create pages in Adaptive Documents with lookups rendering behind the creation modal\n> - Fixed configuration components failing to render on the File component\n\n> ### **1.26.7 - Adaptive Documents**\n> \n> **<span style=\"color: #95a5a6;\">*27/11/2022*</span>**\n> \n> This release replaces Adaptive Forms with the more flexible Adaptive Documents. Documents are powerful way to store and track deep data in a single, transmittable form. This change paves the way for Adaptive Apps to develop custom experiences.\n> \n> As a consequence of this change, Adaptive Designer has been upgraded to support Documents. Additionally this release will include a database upgrade to shift all existing forms into documents.\n> \n> **Features**\n> \n> <span style=\"text-decoration: underline;\">Adaptive Designer v3</span>\n> \n> Designer has undergone significant changes supporting documents. You can now open multiple documents at the same time to make switching between them easier.\n> \n> [![image-1669077016765.png](https://docs.rapidplatform.com/uploads/images/gallery/2022-11/scaled-1680-/Y0Pzl3yHALtpdcJ6-image-1669077016765.png)](https://docs.rapidplatform.com/uploads/images/gallery/2022-11/Y0Pzl3yHALtpdcJ6-image-1669077016765.png)\n> \n> Tab support has also been added to help spread configuration out so you can focus on what you're trying to do.\n> \n> [![image-1669077148713.png](https://docs.rapidplatform.com/uploads/images/gallery/2022-11/scaled-1680-/hn5sanqfi9uVVNRy-image-1669077148713.png)](https://docs.rapidplatform.com/uploads/images/gallery/2022-11/hn5sanqfi9uVVNRy-image-1669077148713.png)\n> \n> **Improvements**\n> \n> - Simplified Universal Link schema to reduce on-disk storage by around 20%\n> - Added Adaptive Documents system list, replacing Adaptive Forms\n> - Associated existing public form tasks to Adaptive Documents\n> - Associated existing process diagrams to Adaptive Documents\n> - Implemented Adaptive Document configuration support into Workflow\n> \n> **Bug Fixes**\n> \n> - Fixed malformed item profile response shape when selecting sys\\_type\\_id\n\n> ### **1.25.15 - Link Performance**\n> \n> **<span style=\"color: #95a5a6;\">*3/11/2022*</span>**\n> \n> **Improvements**\n> \n> - Updated Universal Link handling in Explorer to be more performant on items with many (200+) universal links\n> - Cloning Process Diagrams and Adaptive Forms now will clone the XML and JSON data within\n\n> ### **1.25.14 - API Updates**\n> \n> **<span style=\"color: #95a5a6;\">*6/10/2022*</span>**\n> \n> **New Feature - Default configuration for Date columns on lists**\n> \n> You can now configure a date column in Designer to have a default value. This value is configured as a combination of a relative date plus an offset. For example, Task Start Dates now default to Today, while their Due Date now default to Today +1 (aka: Tommorrow).\n> \n> The list of relative dates to use mirror the configuration for Views and are\n> \n> - today\n> - tomorrow\n> - startOfWeek\n> - endOfWeek\n> - startOfMonth\n> - endOfMonth\n> - startOfQuarter\n> - endOfQuarter\n> \n> As always at RAPID we are looking for feedback on which relative dates you would find useful.\n> \n> **Improvements**\n> \n> - Added $top and $skip independent query parameter support to Omnichannel when fetching a calendarView, previously both keys were required to be processed\n> - \\*Added scroll to connections panel in Adaptive Designer for tables with more than 30 columns\n> - \\*The Get Items service task now regards the selected view, instead of defaulting to the All$ view\n> \n> **Bug Fixes**\n> \n> - Fixed itemFilter configuration failing to be regarded in public forms for child repeating sections\n> - \\*Fixed Prefill data for root level single item contexts being nested under \\_data.\\_data\n> - \\*Removed dead Workflow v2 API routes\n> - \\*Removed dead Workflow v2 test plan routes and UI\n\n> ### **1.25.13 - Adaptive Framework Polish**\n> \n> **<span style=\"color: #95a5a6;\">*27/09/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed prefill data failing to bind in repeating sections\n\n> ### **1.25.12 - Adaptive Framework Polish**\n> \n> **<span style=\"color: #95a5a6;\">*15/09/2022*</span>**\n> \n> **Improvements**\n> \n> - Added trashcan button when configuring DocX service tasks in Workflow that clears all form keys (including hidden ones)\n> - Implemented Multi-Lookup per-fill data support in Public Forms and the Adaptive Designer\n> - Prevented proxied endpoints that contain HTTP Verbs in their url from being truncated in the SDK\n> \n> **Bug Fixes**\n> \n> - Fixed hyperlinks failing to save their target in Static Text controls for the Adaptive Designer\n> - Prevented data visually bleeding between workflow elements of the same type under certain circumstances\n> - Stopped labels of hidden fields showing\n\n> ### **1.25.11 - Time Slot Component**\n> \n> **<span style=\"color: #95a5a6;\">*8/09/2022*</span>**\n> \n> **Features**\n> \n> - Added the Time Slot component to the Adaptive Designer. This component can be configured to an Exchange inbox to allow users to select a date range (aka : time slot) from available times on that calendar.\n> \n> **Improvements**\n> \n> - Added secure attributes to Framework to give control over protected data in public scenarios\n> - Implemented connection binding controls for components that produce more than one scalar value\n> - Updated Framework typings into data-model\n> - Expanded connection support to handle multiple child connection paths\n> \n> **Bug Fixes**\n> \n> - Fixed updating items via public forms failing to submit\n> - General fixes to components and adaptive controls\n> - Fixed email inputs crashing on mount under certain circumstances\n> - Fixed number inputs in embedded forms eating decimal places\n\n> ### **1.25.6 - Hotfix 1**\n> \n> **<span style=\"color: #95a5a6;\">*22/08/2022*</span>**\n> \n> <p class=\"callout warning\"><span style=\"color: #95a5a6;\"><span style=\"color: #999999;\"><span style=\"color: #808080;\">1.25.6 caused a regression that resulted in the site file becoming immutable in rare circumstances. This resulted in the inability to do many common actions </span></span></span></p>\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where the site file becomes 'locked'\n\n> ### **1.25.6 - Minilith Performance**\n> \n> **<span style=\"color: #95a5a6;\">*18/08/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where bulk creating items sometimes caused server instability\n\n> ### **1.25.5 - Workflow Usability**\n> \n> **<span style=\"color: #95a5a6;\">*11/08/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where configuring embedded forms in workflow would return an error\n\n> ### **1.25.4 - Adaptive Scheduler**\n> \n> **<span style=\"color: #95a5a6;\">*28/07/2022*</span>**\n> \n> <p class=\"callout info\"><span style=\"color: #3598db;\">**Site Repair Required**</span></p>\n> \n> **Added the scheduler Control**\n> \n> Adds the [DHX scheduler](https://docs.dhtmlx.com/scheduler/) to Adaptive Designer. Currently this control is in preview mode and was built specifically around providing a booking system. There are more generic uses for this control and these will be more explicitly supported as time goes on.\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where the sharepoint permission call can fail in certain cases\n> - Fixed an issue where a timeout occurs on save when all permissions are cleared from an item\n> \n> **UI/UX Fixes**\n> \n> - Added the ability to set number of default sections in a repeating section\n> - Added the ability to configure multilookup parent connections\n\n> ### **1.25.3 - Saving Minor Fix**\n> \n> **<span style=\"color: #95a5a6;\">*28/07/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed toLowerCase error when saving items\n\n> ### **1.25.2 - Workflow Get Items**\n> \n> **<span style=\"color: #95a5a6;\">*07/07/2022*</span>**\n> \n> **Added a get Items Service task to the workflow engine**\n> \n> A recurring theme in workflows had process writers going to an external source (like power automate) via a webhook in workflow which simply returns a list of items that can be used in the workflow. As this was such a common action it is now possible to directly configure a service task by setting its type to 'Get Items' This allows for filters, select statements and the option to only get items in a linked context.\n> \n> **UI/UX Fixes**\n> \n> - Added the ability for subquery and computed fields to be set as titles on the board control\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where an item will get its permissions set to null if there are extra keys in the permissions object\n\n> ### **1.25.1 - Inherited Fields in Workflow**\n> \n> **<span style=\"color: #95a5a6;\">*30/06/2022*</span>**\n> \n> **Additional Fields for User Tasks in Workflow**\n> \n> A requested feature was added whereby it is now possible to configure sub type fields in workflow for sub types of tasks. This allows custom fields to be added to the ledger which allow it to be referenced by later activities. This feature encompasses the UI upgrade to workflow user task and upgrades to the workflow engine itself to handle these additional fields.\n\n> ### **1.25.0 - Hotfix 1**\n> \n> **<span style=\"color: #95a5a6;\">*27/06/2022* </span>**\n> \n> <p class=\"callout warning\"><span style=\"color: #999999;\"><span style=\"color: #808080;\">1.25.0 caused a regression that resulted in a page crash when viewing or previewing a form that contained an email field within a repeating section  \n> </span></span></p>\n> \n> ****Bug Fixes**** - Fixed a page crash when viewing a form containing an email field within a repeating section\n\n> ### **1.25.0 - Form Service Fast Renderer**\n> \n> **<span style=\"color: #95a5a6;\">*24/06/2022* </span>**\n> \n> **Fast renderer in Form service**\n> \n> A different renderer is now used in the form service, notable speed improvements should be noted when using it, especially with longer forms. Virtualisation is added to repeating sections and views where only 5 instances/rows will be rendered at any given time.\n> \n> **Bug Fixes**\n> \n> - Removed an erroneous multi page nav menu control\n> - Fixed an issue where data can be lost when navigating multi pages\n> - Fixed an issue where CSS classes were propagating to child elements\n> - Fixed an issue where views were not being fetched when configuring a view connection\n> - Fixed a page crash when configuring a condition configured to trigger on 'falsey'\n> - Fixed the inability to set and view choices for choice fields in Designer\n> - Fixed the inability to configure radio inputs\n> \n> **UI/UX Fixes**\n> \n> - Fixed an issue where lookup config was not loading for connections in Designer\n> - Fixed an issue where labels and descriptions sometimes propagated to child elements\n> - Fixed an issue where data can bleed across input attributes in designer\n\n> ### **1.24.8 - Form Service Fast Renderer**\n> \n> **<span style=\"color: #95a5a6;\">*17/06/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where email fields would set their default value to 'true' automatically\n> - Fixed an issue where hidden fields are not being applied correctly in Designer and Preview\n> - Fixed an issue where cancelling form details no longer clears the form in Designer\n> - Fixed the inability to clone a previously cloned element in Designer\n> - Fixed an issue where the first page of multi page is navigated to erroneously\n> - Fixed an issue where views are not fetched when configuring a view in Designer\n> \n> **UI/UX Fixes**\n> \n> - Fixed an issue of config attributes in designer bleeding across different fields\n> - Fixed text fields rendering as not read only in Designer\n> - Updated the component tree in Designer to be more usable\n> - Fixed an issue where repeating sections failed to show one by default\n\n> ### **1.24.7 - Hotfix 1**\n> \n> <span style=\"color: #999999;\">***14/06/2022***</span>\n> \n> <p class=\"callout warning\"><span style=\"color: #999999;\"><span style=\"color: #808080;\">1.24.7 caused a regression with bulk updates in gantt, boards and the bulk update action which caused only the first item to get updated</span></span></p>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - Fixed an issue with bulk updates not performing\n\n> ### **1.24.7 - Adaptive Designer Performance Overhaul**\n> \n> **<span style=\"color: #95a5a6;\">*10/06/2022*</span>**\n> \n> **Sharepoint Permission Sync**\n> \n> When creating or editing an item with a drive and folder set, the same permissions applied to the item will be applied to that item's folder in sharepoint. This ensures that an item's permissions will be the same as the file permissions.\n> \n> **UI/UX Fixes**\n> \n> - Added ability to disable create button for current list on data tables in Explorer\n> - Fixed lookups in public forms displaying '0' when unset\n> - Locale is now set correctly when exporting CSV from data table in Explorer\n> \n> **Improvements**\n> \n> - Overhaul of Adaptive Designer and the Adaptive Renderer which results in major performance benefits. Render and load times are dramatically decreased\n\n> ### **1.24.6 - Public Form Submission**\n> \n> **<span style=\"color: #95a5a6;\">*1/06/2022*</span>**\n> \n> **Improvements**\n> \n> - Public forms with pre-fill data that are missing the \\_\\_metadata tag will now try to insert them where possible\n> \n> **Bug Fixes**\n> \n> - Enabled the following relational data cases to be submitted successfully \n>     - Single Item Create/Update\n>     - View Create/Update\n>     - View linked to Single item via Universal Link Create/Update\n>     - View linked to Single item via Lookup Create/Update\n\n> ### **1.24.5 - Workflow Linking**\n> \n> **<span style=\"color: #95a5a6;\">*26/05/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed erroneous validation preventing creating a universal link between a task and a custom list that contains the word task in its name via Workflow\n\n> ### **1.24.4 - Adaptive Designer Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*12/05/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Prefill Data now gets constructed correctly by workflow in single item cases\n> - Fixed an issue prefill data failed to load in universal link scenarios\n> - Fixed a page crash for view connections that did not contain a columnName attribute\n> - Fixed an issue where UI will not update in workflow to input prefill data in certain cases\n> - Fixed an issue where prefill data cannot be configured for 2 lookups with the same name\n> - Fixed an issue where files failed to be submitted upon form submission\n> \n> **UI/UX Fixes**\n> \n> - Fixed an issue where first click will not perform add repeating section actions\n> - List and column name is now prepended to array prefill data\n\n> ### **1.24.3 - Adaptive Designer Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*05/05/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where action buttons were anchoring to a point on page unexpectedly\n> - Fixed an issue where starting conditions are applied in the design space when configuring conditions\n> \n> **UI/UX Fixes**\n> \n> - Added number input to sliders\n> - Removed some RAPID system controls from the context menu\n> - Now able to set a width and height on embedded controls\n> - Added label to accordion sections\n> - Added the ability to enable time on embedded form date fields in workflow\n> - In Explorer can render embedded forms with date fields with time inputs\n> \n> **Improvements**\n> \n> - Date fields correctly store their value in memory as ISO strings\n\n> ### **1.24.2 - Adaptive Designer Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*28/04/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where repeating sections would display the data of one shared item rather than having their own unique values\n> - Now Able to view dates in excel correctly when exporting as CSV from a data table\n> - Fixed a page crash when adding an element to a section that has fetch Items turned on\n> - Removing a connection now removes all connection data from form schema\n> - Fixed an issue where the column layout will apply row spacing above the top row\n> - Fixed an issue where default values could not be applied to number fields\n> - Fixed the TabControl component where it would not render correctly\n> \n> **UI/UX Fixes**\n> \n> - Clearing border in the styles tab now removes border properly\n> - Re-Added Hidden attribute to fields\n\n> ### **1.24.1 - Adaptive Designer Improvements**\n> \n> **<span style=\"color: #95a5a6;\">*21/04/2022*</span>**\n> \n> **Bug Fixes**\n> \n> - Fixed an issue where duplicate principals can get created rather than linking existing ones in rare cases when using Omnichannel\n> \n> **UI/UX Fixes**\n> \n> - Added a column layout control which allows for evenly spaced columns\n> - Added ability to add a link to an image which will navigate on clicking of the image\n> - Updated the embedded control to allow the input of an iframe html src (like youtube embed)\n> - Currency fields now display the correct UI\n> - Percentage fields now show % icon\n> - Removed validation message on email control\n> - Added the slider input control - outputs a number\n> - Updated the Rating input control - outputs a number\n> \n> **Improvements**\n> \n> - Started to move away form UUID to using NanoID instead\n\n> ### **1.24.0 - Adaptive Framework Improvements**\n> \n> <span style=\"color: #95a5a6;\">***14/04/2022***</span>\n> \n> **Data Table**\n> \n> As a companion to repeating sections the Adaptive Designer now supports the data table control for a more compact way to create, view and edit several items. This control is powered by the new Adaptive data connections using the view mode and is supported in the Anonymous Forms experience.\n> \n> **Bug Fixes**\n> \n> - Fixed creating meeting events more than 3 months in the future causing automation deletion of that event\n> - Fixed crash on sections when using show conditions on children elements\n> - Updated flip card control to show children elements correctly\n> \n> **UI/UX Fixes**\n> \n> - Updated flip card control to show configuration panel correctly\n> - Updated icon for flip card control\n> - Updated boolean controls to new skinny switch\n> \n> **Improvements**\n> \n> - Upgraded Carousel control to work with data connections\n> - Enabled overriding of default data context when using pre-fill data\n\n> ### **1.23.0 - Adaptive Data Connections**\n> \n> <span style=\"color: #95a5a6;\">***07/04/2022***</span>\n> \n> **Bug Fixes**\n> \n> - Fixed whole number control using the decimal input instead of integer input\n> - Prevented grid control generating erroneous element IDs\n> - Prevented creating a new form setting the page into an error state depending on which controls were added before save\n> - Reinstated RAPID Choices being able to use choices defined in the site\n> - Fixed panel crash when collapsing the connections configuration\n> - Updated Carousel to be a layout control type and pass connections\n> - Fixed some configuration failing to dirty the form and prevent saving\n> \n> **UI/UX Fixes**\n> \n> - Removed debug controls from configuration panels\n> - Stopped editing fields from forcing the cursor to the end of the content\n> - Improved control search to accept any text characters and retain it's group panel in all states\n> - Ensured Rapid Attributes configuration is no longer used in configuration panels\n> - Disabled multi-page menu nav control when in edit mode\n> - Reinstated placeholder behaviour missing on various fields\n> - Allowed title to reflect an element label when the title has not been configured\n> - Enabled configuration panels to scroll\n> - Updated control categories to remove uncategorized and redundant field/input split\n> - The Style configuration tab will no longer 'remember' the previous controls configuration\n> - Opening a Office 365 document in the file control will now default to opening the associated local application\n> - Updated default label for buttons to 'Submit' from 'submit'\n> \n> **Improvements**\n> \n> - Added repeating section default buttons\n> - Enabled Submit button to handle multiple instances in Anonymous forms\n> - Added Contains and Equals condition rules for string and joi type conditions\n> - Updated conditions to not process on load in lieu of new initial state configuration\n\n> ### **1.22.3 - Adaptive Data Connections**\n> \n> <span style=\"color: #95a5a6;\">***31/03/2022***</span>\n> \n> <span style=\"color: #95a5a6;\">***(Preview)* Adaptive Connections**</span>\n> \n> <span style=\"color: #95a5a6;\">This release introduces the concept of data connections to Adaptive Schemas created in the Adaptive Designer. Data connections allow you to dictate where data comes from and goes to at a per element level of detail. This preview enables the configuration of the Rapid data connector which replaces the old Rapid Attributes configuration, with plans to extend to other services in the future.</span>\n> \n> <span style=\"color: #95a5a6;\">In addition to being able to have your adaptive forms and apps communicate with more than just Rapid, this feature also enables the configuration of related data. For example, you can now create an adaptive form that creates (or updates) an Invoice along with an arbitrary number of invoice detail lines.</span>\n> \n> <span style=\"color: #95a5a6;\">This feature is in preview with a heavy focus on usability improvements over the next week. Any feedback on your experience using connections is highly appreciated.</span>\n> \n> <span style=\"color: #95a5a6;\">**Fetch and Save buttons**</span>\n> \n> <span style=\"color: #95a5a6;\">Along with being able to define more complicated data structures in your adaptive forms, we have also added actions to control fetching and saving data from your connections. These new actions can be applied to action buttons and allow the updating/saving of specific controls in your form.</span>\n> \n> <span style=\"color: #95a5a6;\">As the Save action only targets one element, complex forms with many disparate items are expected to still use the Submit action to save everything at once.</span>\n> \n> <span style=\"color: #95a5a6;\">**Improved Conditions**</span>\n> \n> <span style=\"color: #95a5a6;\">Conditions also got some love in this release. After feedback we have added an initial state configuration so you can now have forms elements that start hidden/disabled and 'unlock' as their condition is met. We have added in Equals and Contains conditions for text data, also thanks to your feedback.</span>\n> \n> <span style=\"color: #95a5a6;\">**Bug Fixes**</span>\n> \n> - <span style=\"color: #95a5a6;\">Prevented adding controls to blank adaptive sections crashing the page</span>\n> - <span style=\"color: #95a5a6;\">Fixed quickly creating blank adaptive schemas saving corrupt</span>\n> - <span style=\"color: #95a5a6;\">Handled extended characters when searching for controls in the adaptive control picker</span>\n> - <span style=\"color: #95a5a6;\">Prevented page crash when navigating to a new adaptive schema and editing it before all controls had loaded</span>\n> - <span style=\"color: #95a5a6;\">Removed initial condition computation in lieu of initial state setting</span>\n> - <span style=\"color: #95a5a6;\">Resolved some cases where adding controls resolved in a corrupt element path</span>\n> - <span style=\"color: #95a5a6;\">Prevented adaptive grid crashing when trying to render negative columns</span>\n> - <span style=\"color: #95a5a6;\">Fixed adding multi-line of text inputs actually adding a single-line of text control instead</span>\n> - <span style=\"color: #95a5a6;\">Fixed adding a whole number control just adding a number control instead</span>\n> - <span style=\"color: #95a5a6;\">Fixed missing placeholder configuration on input field controls</span>\n> - <span style=\"color: #95a5a6;\">Fixed choice fields trying to save their display content instead of their value</span>\n> \n> <span style=\"color: #95a5a6;\">**UI/UX Fixes**</span>\n> \n> - <span style=\"color: #95a5a6;\">Enabled adding of system fields to adaptive schemas</span>\n> - <span style=\"color: #95a5a6;\">Removed Rapid Attributes panel in lieu of new connections infrastructure</span>\n> - <span style=\"color: #95a5a6;\">Applied element connection controls to all adaptive elements</span>\n> - <span style=\"color: #95a5a6;\">Added Rapid view selector to connection configuration panel</span>\n> - <span style=\"color: #95a5a6;\">Added return to site picker / return to launchpad buttons to main adaptive designer page</span>\n> - <span style=\"color: #95a5a6;\">Enabled panel scroll in configuration panels</span>\n> - <span style=\"color: #95a5a6;\">Removed debug 'data path' controls on some element configuration panels</span>\n> - <span style=\"color: #95a5a6;\">Set title of elements to mirror label when empty</span>\n> - <span style=\"color: #95a5a6;\">Disabled multi-page menu in design mode</span>\n\n> ### **<span data-contrast=\"none\">1.22.2 - RAPID Meetings</span>**\n> \n> <span style=\"color: #999999;\">***24/03/2022***</span>\n> \n> **RAPID Meetings**\n> \n> It is now possible to create manage and sync meetings and meeting events through RAPID. Installing the created Meeting bundle onto your site will give you access to this new feature. A key feature of Meetings is that it will sync with outlook. It will create outlook events and keep them synced to the meeting items in RAPID.\n> \n> **Date Time Field Configuration**\n> \n> When configuring page definitions in RAPID Designer, it is now possible to specify on the attributes of a date time field for time to be configurable. This will allow for a specific time to be saved to an item when viewing the field on the particular page that has time enabled on the field. This time field uses the user's chrome locale so ensuring it is set correctly is important.\n> \n> **Bug Fixes**\n> \n> - Prevented Multilookups and multi line text fields being added the all view upon column creation\n> - Workflow now shows parent relationships correctly\n> - Form schemas are now no longer created corrupt if list name has a space in it\n> - Multilookups are no longer added to the default all view when they are created\n> - Completing a call activity in certain cases will no longer create duplicate tokens on a parallel merge\n> - Ensured update item actions receive correct data structure on submission\n> - Ensured tenant name is lower cased in anonymous forms when fetching css from cdn\n> - Sections in a multi page component within Adaptive Designer now have correct ID's\n> \n> **UI/UX Fixes**\n> \n> - Fixed the displaying of elements in a horizontal layout within adaptive designer\n> - Ensured lookups and boolean fields are disabled on the canvas in adaptive designer\n> - Updated header and panel designer in Adaptive Designer\n> \n> **Improvements**\n> \n> - Added an internal server for omnichannel\n> - Extended the lookup filter and create to scoped and linked items\n> - Added a new system list for internal webhooks\n\n> ### **<span data-contrast=\"none\">1.22.0 - SendGrid Support</span>**\n> \n> <span style=\"color: #999999;\">***10/03/2022***</span>\n> \n> **SendGrid Support**\n> \n> It is now possible to integrate your RAPID Site with sendgrid. It is possible to send emails using this service both through action buttons configured for a list through Explorer and on send and receive tasks through workflow. Refer [here](https://docs.rapidplatform.com/books/rapid-api/page/setting-up-sendgrid-email-support) for a breakdown on configuring sendgrid and integrations to your RAPID site.\n> \n> 1. Receive Tasks.   \n>     These will pause a process run and wait for an email from the specified address to the specified address. Note, the receiving address must have its domain and subdomain configured through sendgrid\n> 2. Send Tasks  \n>     These allow you to select an integration and allow the selection of a template from sendgrid to use and allow for the input of variables into this template. It is possible to use expressions in the configuration for the send task in workflow. Executing a send task will send the email, in the template chosen (if one) to the nominated email. The process will then continue.\n> \n> **Hidden Field Support**\n> \n> Added the ability to set the hidden attribute on a field. Setting this will prevent the field from displaying on a form when that form is opened in either the form or anonymous form experiences. It makes the field immutable but retains the ability for the data to be submitted. The purpose of this is to allow forms to be configured and have data submitted without allowing the user to change or see the data. To configure a field to be hidden, set the hidden attribute on the desired field in the Adaptive Designer.\n> \n> **Bug Fixes**\n> \n> - Prevented Multilookups and multi line text fields being added the all view upon column creation\n> - Workflow now shows parent relationships correctly\n> \n> **UI/UX Fixes**\n> \n> - Changed the default pages for public form tasks to make them more usable\n> - Added the ability to use a context menu to add elements before and after in Adaptive Designer\n> - In Adaptive Designer, adding a user field will now set the column that is being looked up (full name)\n> \n> **Improvements**\n> \n> - Added new system lists which lays the groundwork for Sendgrid and Twilio support (site repair required)\n> - In Adaptive Designer, adding elements now uses an action\n\n> ### **<span data-contrast=\"none\">1.21.1 - Fill in the Blank (Adaptive Designer)</span>**\n> \n> <span style=\"color: #999999;\">***09/03/2022***</span>\n> \n> **Fill in the Blank Component**\n> \n> Added the following component into the Adaptive Designer. It allows for another way of entering data. The intended use for the fill in the blank component is when a form designer wants to make a questionnaire where the inputted answers will be within a block of text. The Fill in the blank component supports all field inputs along with the static text component.\n> \n> **Bug Fixes**\n> \n> - Fixed adding preconfigured fields to a form through the context menu\n> \n> **UI/UX Fixes**\n> \n> - Added the ability to select base entity fields when an inherited list is selected\n> - Lookups no longer show an ID in Anonymous forms\n> - Added the ability to clear attribute and style fields in Designer\n> - In Designer, made user fields read only\n> - Now able to set an icon and custom label on a submit button\n\n> ### **<span data-contrast=\"none\">1.21.0 - Prefill Anonymous Form Data</span>**\n> \n> <span style=\"color: #999999;\">***28/02/2022***</span>\n> \n> **Prefill Data**\n> \n> <span data-contrast=\"auto\">It is now possible to create anonymous forms where field(s) in that anonymous form have data already in them. This data can be dynamically generated by workflow using expressions. </span><span data-ccp-props=\"{\"201341983\":0,\"335551550\":1,\"335551620\":1,\"335559739\":0,\"335559740\":240}\"> </span>\n> \n> - <span data-contrast=\"auto\">Adds UI in workflow to configure prefill data</span><span data-ccp-props=\"{\"201341983\":0,\"335551550\":1,\"335551620\":1,\"335559737\":0,\"335559739\":0,\"335559740\":240}\"> </span>\n> - <span data-contrast=\"auto\">Updated the Form Service to accept prefill data</span>\n> \n> **Read Only Fields in Explorer**\n> \n> <span class=\"TextRun SCXW123567048 BCX0\" data-contrast=\"auto\" lang=\"EN-AU\" xml:lang=\"EN-AU\"><span class=\"NormalTextRun SCXW123567048 BCX0\" data-ccp-parastyle=\"No Spacing\">It is now possible through page design to set fields to read only, this will allow items to be created or modified externally, but when viewed from Explorer will present the field as Read Only</span></span><span class=\"EOP SCXW123567048 BCX0\" data-ccp-props=\"{\"201341983\":0,\"335551550\":1,\"335551620\":1,\"335559739\":0,\"335559740\":240}\"> </span>\n> \n> **<span data-contrast=\"none\">Improvements</span>**\n> \n> - Updated how JSON objects are parsed to Minilith\n\n> ### **<span data-contrast=\"none\">1.20.1 - Anonymous Forms</span>**\n> \n> <span style=\"color: #999999;\">***15/01/2022***</span>\n> \n> **<span data-contrast=\"auto\">Anonymous Forms</span>**<span data-contrast=\"auto\">You can now create publicly accessible forms via Workflow. An anonymous form has a unique URL that you can send to a 3</span><span data-contrast=\"auto\">rd</span><span data-contrast=\"auto\"> party to fill in. When they submit the form it will then complete the form task which allows your processes to wait until it is completed before moving on. Completed forms will then prevent a person from submitting that form again.</span>\n> \n> <span data-contrast=\"auto\">You can also create anonymous forms ad-hoc by creating a form task. This will generate the unique URL within the task automatically. Ad-hoc form tasks can also be flagged as persistent which will prevent the task from being completed on submission, so that you can send the same form to multiple people.</span>\n> \n> **<span data-contrast=\"none\">UI/UX Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Added missing icons for some note types in the Activity Feed</span>\n> - <span data-contrast=\"auto\">Prevented description icon being place in incorrect location in designer</span>\n> - <span data-contrast=\"auto\">Removed choice specific configuration on non-choice fields</span>\n> - <span data-contrast=\"auto\">Set the default title and icon for Adaptive Forms system list</span>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Fixed dart-sass upgrade removing styles</span>\n> - <span data-contrast=\"auto\">Prevented updating a diagram element affecting unrelated elements</span>\n> - <span data-contrast=\"auto\">Fixed error on adding a template file to an embedded file definition</span>\n> - <span data-contrast=\"auto\">Updated recursive task fetching to regard deleted tasks in the middle of the tree</span>\n> - <span data-contrast=\"auto\">Fixed placeholder permissions not being configurable on inherited fields</span>\n> - <span data-contrast=\"auto\">Fixed Linked To lists failing to fetch items via inherited multi-lookup fields</span>\n> - <span data-contrast=\"auto\">Fixed call activity inputs failing to process Lodash templates</span>\n> \n> **<span data-contrast=\"none\">Improvements</span>**\n> \n> - <span data-contrast=\"auto\">Updated OpenAPI typings for subquery and computed fields</span>\n> - <span data-contrast=\"auto\">Added API routes for view manipulation, see the docs for a breakdown</span>\n\n> ### **<span data-contrast=\"none\">1.20.0 - Workflow Usability</span>**\n> \n> <span style=\"color: #999999;\">***1/12/2021***</span>\n> \n> **<span data-contrast=\"none\">UI/UX Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Added tree view to workflow diagrams following the Parent column</span>\n> - <span data-contrast=\"auto\">Removed blur effect on process diagrams</span>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Fixed missing error messages on workflow results pane</span>\n> - <span data-contrast=\"auto\">Fixed page crash on selecting a call activity process for v1 diagrams</span>\n> - <span data-contrast=\"auto\">Resolved test plan diagrams failing to render</span>\n> - <span data-contrast=\"auto\">Prevented uploaded erroneous file names crashing the bundles parser</span>\n> - <span data-contrast=\"auto\">Prevented sequence flow</span>\n\n> ### **1.19.12 - Hotfix**\n> \n> <span style=\"color: #999999;\">***26/11/2021***</span>\n> \n> <p class=\"callout warning\"><span style=\"color: #808080;\">The previous release (1.19.11) caused a regression which caused a page crash in RAPID Explorer upon interacting with the Explorer nav menu when configured and interacted with in a particular way.</span></p>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - Fixed regression where expanding an Explorer nav menu item will navigate to a page crash\n> - Fixed call activity inputs to regard expressions and all field types\n\n> ### **1.19.11 - General Usability**\n> \n> <span style=\"color: #999999;\">***25/11/2021***</span>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - Fixed regression where a template file is unable to be selected in Workflow\n> - Fixed the recursive link items to respect if a parent item is deleted and then not recurse down in Explorer\n> - Fixed placeholder permissions not being applied correctly when an inherited user field is created\n> - Fixed a rare issue where inherited types may not be fetched in LinkedTo context if they are linked through a multi-lookup\n> \n> **<span data-contrast=\"none\">UI/UX Fixes</span>**\n> \n> - Fixed minor UI issue with parallel gateways in Workflow\n> - Changed the diagram filtering in Workflow to be case insensitive\n> - Added Icons to update notes in the activity feed\n> - Prevented a tooltip hover covering the close action button on certain field types in Designer\n> - Removed a field configuration option for choice type from unrelated fields in the properties pane of a field in Designer\n> - Added icons and title for the Adaptive system list\n> \n> **<span data-contrast=\"none\">Improvements</span>**\n> \n> - Added routes to allow users to create and access database views \n>     - This change is fundamental to the Reporting experience which relies on giving the ability for users to create their own views which they can then use in their reporting\n\n> ### **1.19.10 - Hotfix**\n> \n> <span style=\"color: #999999;\">***16/11/2021***</span>\n> \n> <p class=\"callout warning\"><span style=\"color: #999999;\"><span style=\"color: #808080;\">The previous release (1.19.9) caused a regression where upon fresh page loads , under rare circumstances would leave the local store (browser storage) in a corrupt state which would lead to a page crash. </span></span></p>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - Fixed the inability to lock the All View from Designer if the view has not previously been modified\n> - Fixed a page crash when opening in items in rare cases after a refresh\n\n> ### **1.19.9 - RAPID Reports**\n> \n> <span style=\"color: #999999;\">***16/11/2021***</span>\n> \n> **<span data-contrast=\"auto\">List support for Action Buttons</span>**\n> \n> <span data-contrast=\"auto\">You can now opt for Action Buttons to be presented on items and/or lists. When triggered from a list an action will be made for each selected item on that list.</span>\n> \n> <span data-contrast=\"auto\">In addition, you can now configure a Form to request additional information when pressing an Action Button. These are pulled from your list of Forms in the new Forms Experience and will submit the collected information along with each request.</span>\n> \n> <span data-contrast=\"auto\">Please note that in list scenarios only one form is collected for all selected items.</span>\n> \n> **<span data-contrast=\"auto\">RAPID Forms (Preview)</span>**\n> \n> <span data-contrast=\"auto\">Building on top of the current Form builder in Designer, Forms empowers you to build nice looking input forms with control over styling and support for making more than one kind of item at once.</span>   \n> <span data-contrast=\"auto\">Custom layout options now include support for </span>\n> \n> - <span data-contrast=\"auto\">sections and sub-sections</span>\n> - <span data-contrast=\"auto\">both horizontal and vertical layouts, including multi-column forms</span>\n> - <span data-contrast=\"auto\">Linkert display for questionnaires</span>\n> - <span data-contrast=\"auto\">and conditional visibility based on form content</span>\n> \n> <span data-contrast=\"auto\">RAPID Forms are broken into two parts:</span>\n> \n> <span data-contrast=\"auto\">1) </span>[<span data-contrast=\"none\">Form Designer</span>](https://designer.rapidplatform.com/)<span data-contrast=\"auto\"> - Build and design your forms with custom layouts</span>\n> \n> <span data-contrast=\"auto\">2) </span>[<span data-contrast=\"none\">Forms</span>](https://forms.rapidplatform.com/)<span data-contrast=\"auto\"> - Browse the forms on your site and fill them in</span>\n> \n> **<span data-contrast=\"auto\">RAPID Reports (Preview)</span>**\n> \n> [<span data-contrast=\"none\">Reports</span>](https://reports.rapidplatform.com/)<span data-contrast=\"auto\"> enables the creation of PowerBI reports based on your RAPID data straight in your web browser. This is an extension of PowerBI edit mode in Explorer.</span>\n> \n> <span data-contrast=\"auto\">In addition to helping show what reports are currently on the site, you can also create Dashboards that organise reports and views into handy groups to make keeping track of your site data easier than ever.</span>\n> \n> **<span data-contrast=\"none\">UI/UX Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Added state preservation to pages in Explorer</span>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Prevented forms breaking when trying to render a deleted column</span>\n> - <span data-contrast=\"auto\">Prevented embedded file components creating their configured sub folder twice</span>\n> \n> **<span data-contrast=\"none\">Improvements</span>**\n> \n> - <span data-contrast=\"auto\">Updated error handling in SDK to have friendlier error messages</span>\n\n> ### **1.19.8 - Email Attachments**\n> \n> <span style=\"color: #999999;\">***20/10/2021***</span>\n> \n> **Attachments for Email Service Tasks**\n> \n> <span data-contrast=\"auto\">Adding extra functionality to the current email service task for workflow, This allows process writers to add one or more sharepoint drive Item ID's and Folder ID's to the configuration of an email service task, these can be dynamically generated using Lodash expressions. Upon execution of that email service task, the email will be sent with the attachments specified. </span>\n> \n> **UI/UX**\n> \n> - <span data-contrast=\"auto\">Added page state; re-opening an item or page in Explorer will retain the previously opened context</span>\n> \n> **Bug Fixes**\n> \n> - <span data-contrast=\"auto\">Fixed double folders being created when adding files to an embedded file component under certain circumstances</span>\n> - <span data-contrast=\"auto\">Made embedded forms more resilient by validating out deleted columns</span>\n\n> ### **1.19.6 - Embedded Form Rework**\n> \n> **<span style=\"color: #999999;\">*12/10/2021*</span>**\n> \n> **UI/UX Fixes**\n> \n> - <span data-contrast=\"auto\">Fixed embedded form data loading on item load</span>\n> \n> **Bug Fixes**\n> \n> - <span data-contrast=\"auto\">Fixed a page crash when viewing process diagrams with null versions</span>\n> - <span data-contrast=\"auto\">Fixed the ability to set the value of dates in embedded forms to null</span>\n> - <span data-contrast=\"auto\">Fixed corruption to service tasks configuration when changing service task types on the same element</span>\n> \n> **Improvements**\n> \n> - <span data-contrast=\"auto\">Embedded forms in Explorer are now rendered as adaptive forms</span>\n\n> ### **1.19.5 - Item Action Buttons**\n> \n> <span style=\"color: #999999;\">***11/10/2021***</span>\n> \n> **<span data-contrast=\"auto\">Action Buttons on Items</span>**\n> \n> <span data-contrast=\"auto\">It is now possible to configure custom action buttons on items in the command bar. These actions include existing menu support to open pages and custom links as well as to trigger custom server endpoints (such as Flows).</span>\n> \n> <span data-contrast=\"auto\">For example, you can now configure a custom Delete action that triggers a Flow which can then delete both the clicked item and all linked items to make ‘bulk’ administration easier.</span><span data-ccp-props=\"{\"201341983\":0,\"335559739\":0,\"335559740\":240}\">  \n> </span><span data-contrast=\"auto\">For support in creating and designing your custom actions please contact your representative.</span>\n> \n> **<span data-contrast=\"auto\">Workflow v2 Input Support</span>**\n> \n> <span data-contrast=\"auto\">Workflow v2 Diagrams can now support Inputs and Outputs both for manually started processes as well as Call Activities. These inputs can be </span>[<span data-contrast=\"none\">referenced</span>](https://docs.rapidplatform.com/books/workflow-v2/page/process-inputs)<span data-contrast=\"auto\"> within processes using both adaptive expressions and directly on conditional gateways.</span>\n> \n> <span data-contrast=\"auto\">This allows for the creation of processes that can understand the context they are being triggered from without needing to use signal events. As you start building input driven processes, try executing a process manually form within Explorer for that extra ‘on demand’ convenience.</span>\n> \n> **<span data-contrast=\"auto\">Workflow v2 Test Plans</span>**\n> \n> <span data-contrast=\"auto\">For those wanting to ensure their processes keep doing what they expect you can now create test plans for v2 diagrams. Test plans run in a sandbox environment that will not affect anything outside the test. Tests cannot trigger webhooks, create or edit items and cause any other permanent side-effect. </span>\n> \n> <span data-contrast=\"auto\">When writing a test plan you provide what external information you expect to occur within the test letting you test different scenarios quickly and easily. Test plans are saved making re-testing changes to existing workflows quicker and easier.</span>\n> \n> **<span data-contrast=\"auto\">Bundles v2</span>**\n> \n> <span data-contrast=\"auto\">Bundle support has been overhauled to now support zipped files, which can include table, menu and PowerBI report items to be imported. Extracting a bundle will now generate in the new format. The library of existing bundles have also been updated to conform to the new structure.</span>\n> \n> **<span data-contrast=\"none\">UI/UX Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Updated advanced pages in Designer to conform to same style</span>\n> - <span data-contrast=\"auto\">Updated signal condition hint text to be accurate for Workflow v2</span>\n> - <span data-contrast=\"auto\">Removed blank option for column types</span>\n> - <span data-contrast=\"auto\">Added word counter on table name creation (limit 50)</span>\n> - <span data-contrast=\"auto\">Added ability to configure time when creating a manual reminder</span>\n> - <span data-contrast=\"auto\">Added configuration to display a choice field as a radio button in Designer</span>\n> - <span data-contrast=\"auto\">Updated delete button in Workflow to use bulk delete action</span>\n> - <span data-contrast=\"auto\">Removed un-used type configuration on Call Activity inputs</span>\n> - <span data-contrast=\"auto\">Added ability to choose which sub-types appear on specific data tables</span>\n> - <span data-contrast=\"auto\">Improved render speed of menu configuration page for sites with large numbers of users</span>\n> - <span data-contrast=\"auto\">Added array handling to DocX template actions in Workflow v1</span>\n> - <span data-contrast=\"auto\">Improved error messages on PowerBI upload</span>\n> - <span data-contrast=\"auto\">Upgraded embedded form components to use new SDK components</span>\n> - <span data-contrast=\"auto\">Improved styling when viewing process runs for Workflow v1 and v2 in Explorer</span>\n> - <span data-contrast=\"auto\">Fixed embedded date fields with erroneous dates showing NaN for all options</span>\n> - <span data-contrast=\"auto\">Updated spelling on table configuration warning message</span>\n> \n> **<span data-contrast=\"none\">Bug Fixes</span>**\n> \n> - <span data-contrast=\"auto\">Fixed search request for Org Wide emails fetching too many emails</span>\n> - <span data-contrast=\"auto\">Fixed process inputs with null values failing to generate</span>\n> - <span data-contrast=\"auto\">Fixed call activities failing to navigate on click in Explorer</span>\n> - <span data-contrast=\"auto\">Fixed white on white text in menu configuration panel</span>\n> - <span data-contrast=\"auto\">Ensured errors on process run items in Workflow v2 apply visually</span>\n> - <span data-contrast=\"auto\">Prevented changing service task type failing to clean up after itself</span>\n> - <span data-contrast=\"auto\">Fixed opening workflow results panel completing a selected task</span>\n> - <span data-contrast=\"auto\">Prevented page crash in Explorer when manually executing a process with lookup inputs</span>\n> - <span data-contrast=\"auto\">Fixed inputs failing to display in workflow results panel</span>\n> - <span data-contrast=\"auto\">Prevented bulk delete from trying to delete 0 items</span>\n> - <span data-contrast=\"auto\">Prevented page crash when fetching empty diagrams</span>\n> - <span data-contrast=\"auto\">Fixed lookup inputs in processes failing to auto-populate when triggered in Explorer</span>\n> - <span data-contrast=\"auto\">Prevented multi-lookup columns being applied as title columns on tables</span>\n> - <span data-contrast=\"auto\">Stopped endless loop when trying to delete an already deleted item</span>\n> - <span data-contrast=\"auto\">Fixed saving a diagram preventing further edits to fail to save</span>\n> - <span data-contrast=\"auto\">Fixed lookup item creation failing to create sub-types</span>\n> - <span data-contrast=\"auto\">Ensured task notifications are generated when the new assigned to User is the last editor</span>\n> - <span data-contrast=\"auto\">Prevented editing Principals directly through the API</span>\n> - <span data-contrast=\"auto\">Updated Get Item service task to regard expressions in Workflow v2</span>\n> - <span data-contrast=\"auto\">Fixed embedded form configuration with universal links failing to create those links in Workflow v2</span>\n> - <span data-contrast=\"auto\">Ensured expressions in Workflow v2 only regard the last item in looping scenarios</span>\n> - <span data-contrast=\"auto\">Fixed emailing a single file from the File Browser entering an infinite loop</span>\n> - <span data-contrast=\"auto\">Prevented double fetching of items in linked context</span>\n> - <span data-contrast=\"auto\">Fixed bulk deletion failing to update inherited tables</span>\n> - <span data-contrast=\"auto\">Prevented rules on conditional gateway sequence flows marked as default from being calculated</span>\n> - <span data-contrast=\"auto\">Updated actions in menu sidebar contexts to not try and post a missing item profile</span>\n> \n> **<span data-contrast=\"none\">Improvements</span>**\n> \n> - <span data-contrast=\"auto\">Added principal display and UPN support to network requests</span>\n> - <span data-contrast=\"auto\">Implemented multi-site context management into SDK</span>\n> - <span data-contrast=\"auto\">Added controls to disable AutoFetch in ManagedViewContext in SDK</span>\n> - <span data-contrast=\"auto\">Added typings for Workflow Test Plans to Data-Model</span>\n> - <span data-contrast=\"auto\">Upgraded table deletion to also include shadow views</span>\n> - <span data-contrast=\"auto\">Added expression support for embedded form content into Workflow v2</span>\n> - <span data-contrast=\"auto\">Added unique embedded form IDs in Workflow</span>","name":"Changelog","created_at":"2022-01-06T05:05:58.000000Z","updated_at":"2023-12-13T09:31:14.000000Z","url":"https://docs.rapidplatform.com/books/rapid-overview/page/changelog"}