{"id":"P307","slug":"glossary","content":"# Glossary\n\n#### Lead\n\n#### Account\n\n#### Opportunity \n\n#### Contact\n\n#### Quote\n\n#### Project\n\n#### Task\n\n#### Asset\n\n#### IT Asset\n\n#### Vehicle\n\n#### Industry\n\n#### Invoice\n\n#### Bill\n\n#### Project Objectives\n\nEvery project should have objectives. These are what you are trying to accomplish in the project. It is important throughout the project to keep the status of the objective up to date as these will feed into the ‘Project Sign-off’ process.\n\n#### Project Deliverable\n\nProject deliverables encompass the tangible and intangible outcomes that the project aims to produce. These could include documents, products, services, or any other items that contribute to the project's success. Deliverables are used in the ‘Project Sign-off’ process.\n\n#### Project Risk\n\nProject risks are uncertainties that could impact successful project completion. These may arise from external factors, changing requirements, resource constraints, or technological challenges. It involves identifying, assessing, and mitigating potential threats through proactive planning and ongoing monitoring.\n\n#### Project Exclusion\n\nProject exclusions set boundaries by specifying what is not included in the project scope. Clearly communicating these exclusions helps manage expectations, prevent scope creep, and maintain focus on key deliverables.\n\n#### Project Budget\n\nBudget items enable the application of estimated costs for different elements (labour materials, etc.) to obtain an overall estimated project cost. This is crucial for assessing the project's profitability. Upon project completion, the budget items include a column for inputting actual costs. This ensures clear visibility in reports, allowing for a comparison between estimated project costs and actual costs.\n\n#### Department\n\n#### Employee\n\n#### Performance Review\n\n#### Probation Review\n\n#### Policy\n\n#### Leave Request","name":"Glossary","created_at":"2023-12-18T05:46:37.000000Z","updated_at":"2023-12-27T06:19:25.000000Z","url":"https://docs.rapidplatform.com/books/glossary-dsE/page/glossary"}